Show / Hide Table of Contents
Class ResultOfMember2
Result of the member
Inheritance
System.Object
ResultOfMember2
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
[Obsolete]
public class ResultOfMember2
Constructors
Improve this Doc   View Source
ResultOfMember2()
Constructor
Declaration
public ResultOfMember2()
Improve this Doc   View Source
ResultOfMember2(Member)
Constructor
Declaration
public ResultOfMember2(Member member)
Parameters
 Type |  Name |  Description
 Member |  member
Member
Properties
Improve this Doc   View Source
Member
Member
Declaration
public Member Member { get; set; }
Property Value
 Type |  Description
 Member
Improve this Doc   View Source
Results
List of result
Declaration
public List<ResultInSection> Results { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ResultInSection>
 Improve this Doc
 View Source